In [8]:
import pandas as pd
import numpy as np
import seaborn as sns

In [9]:
titanic = sns.load_dataset('titanic')

In [10]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [11]:
titanic.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [12]:
titanic.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [13]:
diamonds = sns.load_dataset('diamonds')

In [14]:
diamonds.head()

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2   0.23     Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3   0.29  Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4   0.31     Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75

In [15]:
diamonds.shape

(53940, 10)

In [16]:
diamonds.isnull().sum()

carat      0
cut        0
color      0
clarity    0
depth      0
table      0
price      0
x          0
y          0
z          0
dtype: int64

In [17]:
diamonds.loc[0]

carat       0.23
cut        Ideal
color          E
clarity      SI2
depth       61.5
table         55
price        326
x           3.95
y           3.98
z           2.43
Name: 0, dtype: object

In [18]:
diamonds.loc[0,'carat']

0.23

In [56]:
tips = sns.load_dataset('tips')

In [57]:
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [58]:
tips_copy = tips[0:5]

In [59]:
tips_copy

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [68]:
# tips_copy['size'] = tips_copy['size'] * 100
tips_copy.loc[tips_copy['size'] == 2]

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
3       23.68  3.31    Male     No  Sun  Dinner     2

In [72]:
tips_copy.loc[tips_copy['size']==2]

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
3       23.68  3.31    Male     No  Sun  Dinner     2

In [80]:
tips_copy_test_01 = tips_copy['size'].value_counts(normalize=True).head
tips_copy_test_01

<bound method NDFrame.head of 3    0.4
2    0.4
4    0.2
Name: size, dtype: float64>

In [82]:
tips_copy

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [85]:
tips_copy['size'].unique()

array([2, 3, 4])

In [94]:
#total_bill top 3
tips_copy['total_bill'].nlargest(3).sort_values(ascending=False)

4    24.59
3    23.68
2    21.01
Name: total_bill, dtype: float64

In [97]:
s = pd.Series([0,1,np.nan,3])
s

0    0.0
1    1.0
2    NaN
3    3.0
dtype: float64

In [106]:
s_01= s.copy()
s_result=s_01.fillna(method='ffill')
s_result

0    0.0
1    1.0
2    1.0
3    3.0
dtype: float64

In [108]:
s_02 = s.copy()
s_result = s_02.fillna(method='bfill')
s_result

0    0.0
1    1.0
2    3.0
3    3.0
dtype: float64

In [116]:
iris = sns.load_dataset('iris')

In [110]:
iris.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [111]:
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [112]:
#중복된 값에 대한 카운트
iris.duplicated().sum()

1

In [113]:
#열에 대한 unique
iris['species'].unique()

array(['setosa', 'versicolor', 'virginica'], dtype=object)

In [115]:
#중복된 열 정보 삭제
iris['species'].drop_duplicates()

0          setosa
50     versicolor
100     virginica
Name: species, dtype: object

In [117]:
iris_dup = iris.copy()

In [119]:
iris_dup.iloc[[0]]

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa

In [120]:
iris_dup.iloc[1,:] = iris.iloc[0,:] #중복 데이터를 만들기 위해

In [121]:
iris_dup.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           5.1          3.5           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [122]:
#중복 데이터 확인
iris_dup.duplicated().sum()

2

In [123]:
#중복 제거.
iris_dup.drop_duplicates(inplace=True)

In [124]:
iris_dup.shape

(148, 5)